//! Этот скрипт сборки копирует файл `memory.x` из корня крейта в каталог, где линкер всегда сможет найти его во время сборки.
//! Для многих проектов это необязательно, так как линкер всегда ищет файлы в корне проекта (там, где лежит `Cargo.toml`). Однако если вы используете workspace или более сложную схему сборки, этот скрипт становится обязательным. Кроме того, благодаря тому, что Cargo перезапускает скрипт сборки при каждом изменении `memory.x`, после обновления файла приложение гарантированно пересобирается с новыми настройками памяти.

use std::env;
use std::fs::File;
use std::io::Write;
use std::path::PathBuf;

fn main() {
    // Кладём `memory.x` в наш выходной каталог и убеждаемся,
    // что он находится в пути поиска линкера.
    let out = &PathBuf::from(env::var_os("OUT_DIR").unwrap());
    File::create(out.join("memory.x"))
        .unwrap()
        .write_all(include_bytes!("memory.x"))
        .unwrap();
    println!("cargo:rustc-link-search={}", out.display());

    // По умолчанию Cargo перезапускает скрипт сборки при изменении
    // любого файла проекта. Указав здесь `memory.x`, мы добиваемся того,
    // что скрипт перезапускается только при изменении `memory.x`.
    println!("cargo:rerun-if-changed=memory.x");
}
